Revit 2027 API
ElementId.InvalidElementId Property
 Get the invalid ElementId whose value is -1.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId InvalidElementId { get; }
Public Shared ReadOnly Property InvalidElementId As ElementId
	Get
public:
static property ElementId^ InvalidElementId {
	ElementId^ get ();
}
static member InvalidElementId : ElementId with get
Property Value
ElementId
See Also
Reference
ElementId Class
Autodesk.Revit.DB Namespace